[M_IrisEp6_LongWayToTheTop MissionDefinition]
MissionDescription="Piston is waiting for you in the [place]Torgue Arena[-place].<br><br>Kill him."

[M_IrisEp6_LongWayToTheTop:DestroyTruckasarus MissionObjectiveDefinition]
ProgressMessage="Destroy Badassasaurus"

[M_IrisEp6_LongWayToTheTop:FightPiston MissionObjectiveDefinition]
ProgressMessage="Fight Piston"

[M_IrisEp6_LongWayToTheTop:GatherPlayers MissionObjectiveDefinition]
ProgressMessage="Assemble in the Arena"
